#Область СлужебныеПроцедурыИФункции
Функция СообщениеОтправленоУспешно(ТекстСообщения) Экспорт 
	Соединение = Новый HTTPСоединение("api.telegram.org",,,,,, Новый ЗащищенноеСоединениеOpenSSL()); 
	HTTPЗапрос = Новый HTTPЗапрос("/bot" + Константы.ВКМ_ТокенУправленияТелеграмботом.Получить() + "/sendMessage");
	HTTPЗапрос.УстановитьТелоИзСтроки(ЗаписатьДанныеВJson(Новый Структура("chat_id, text", Константы.ВКМ_ИдентификаторГруппыТелеграм.Получить(), ТекстСообщения)),,ИспользованиеByteOrderMark.НеИспользовать);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");	
		
	Ответ = Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
	Результат = ПолучитьИзСтрокиJson(Ответ.ПолучитьТелоКакСтроку());  
	
	Возврат Результат.ok;
КонецФункции     

Функция ЗаписатьДанныеВJson(Данные) Экспорт
    ЗаписьJSON = Новый ЗаписьJSON;
    
    ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);
    ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
    ЗаписатьJSON(ЗаписьJSON, Данные);
    
    Возврат ЗаписьJSON.Закрыть();
КонецФункции

Функция ПолучитьИзСтрокиJson(СтрокаДанных) Экспорт
    ЧтениеJson = Новый ЧтениеJSON;
    ЧтениеJson.УстановитьСтроку(СтрокаДанных);
    Возврат ПрочитатьJSON(ЧтениеJson);
КонецФункции
#КонецОбласти