#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
     ВКМ_СделатьДвижения();
КонецПроцедуры  
#КонецОбласти  

#Область СлужебныеПроцедурыИФункции 

Процедура ВКМ_СделатьДвижения()
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Для Каждого ТекСтр Из Сотрудники Цикл
	    ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
	    ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Расход;
	    ДвижениеВзаиморасчеты.Период = Дата;
	    ДвижениеВзаиморасчеты.Сотрудник = ТекСтр.Сотрудник;
	    ДвижениеВзаиморасчеты.Сумма = ТекСтр.Сумма; 
		ДвижениеВзаиморасчеты.Регистратор = Ссылка;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли