
#Область СлужебныеПроцедурыИФункции

Функция ВКМ_ПолучитьТаблицуУведомленийДляОтправки() 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
		|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ВКМ_ОтправкаУведомленийТелеграм() Экспорт
	ТаблицаУведомленийДляОтправки = ВКМ_ПолучитьТаблицуУведомленийДляОтправки(); 
	МассивОтправленныхУведомлений = Новый Массив;
	
	Для Каждого ТекУведомление Из ТаблицаУведомленийДляОтправки Цикл
		Если ВКМ_Телеграм.СообщениеОтправленоУспешно(ТекУведомление.ТекстСообщения) Тогда 
			 МассивОтправленныхУведомлений.Добавить(ТекУведомление.Ссылка);
		КонецЕсли;
	КонецЦикла; 
	
	Пока МассивОтправленныхУведомлений.Количество() > 0 Цикл   
		УведомлениеОбъект = МассивОтправленныхУведомлений[0].ПолучитьОбъект();

		Попытка  
			УведомлениеОбъект.Удалить();
		Исключение
			ЗаписьЖурналаРегистрации("Ошибка при удалении уведомления телеграм", УровеньЖурналаРегистрации.Ошибка,,,"Ошибка - " + Строка(ОписаниеОшибки()));	
		КонецПопытки; 
		
		МассивОтправленныхУведомлений.Удалить(0);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

