
#Область ОписаниеПеременных

Перем ЭтоНовый, СменилосьВремя, СменилсяСпециалист;

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ВКМ_ДокументНеСоответствуетТребованиям() Тогда
		Отказ = Истина;
	КонецЕсли;
	
 	ПроцентСпециалиста = ПолучитьПроцентСпециалиста();
	Если ПроцентСпециалиста = Неопределено Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не Отказ Тогда
		ВКМ_СделатьДвиженияДокумента(ПроцентСпециалиста); 
	КонецЕсли;		
	
КонецПроцедуры 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	Если Отказ Тогда   
		Возврат;
	КонецЕсли; 
	
	Если ОбменДанными.Загрузка Тогда
		Возврат; // Не отправляем уведомления при загрузке данных
	КонецЕсли;
		
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Дата,
		|	ВКМ_ОбслуживаниеКлиента.Специалист
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ВыборкаДатаДокумента = ВыборкаДетальныеЗаписи.Дата;
		ВыборкаСпециалист = ВыборкаДетальныеЗаписи.Специалист;
	КонецЕсли;
	
	//ПараметрыЗаписи.Вставить("ЭтоНовый", Ложь);
	Если Не ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
		ЭтоНовый = Истина; 
		Возврат;
	Иначе
		ЭтоНовый = Ложь;
	КонецЕсли;   
	
	// Сброс флагов для существующего документа
	СменилосьВремя = Ложь;
	СменилсяСпециалист = Ложь;
	
	//ПараметрыЗаписи.Вставить("СменилосьВремя", Ложь);
	Если ВыборкаДатаДокумента <> Дата Тогда
		СменилосьВремя = Истина;
	КонецЕсли; 
	
	//ПараметрыЗаписи.Вставить("СменилсяСпециалист", Ложь);
	Если ВыборкаСпециалист <> Специалист Тогда
		СменилсяСпециалист = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат; // Не отправляем уведомления при загрузке данных
	КонецЕсли;
	
	Если ЭтоНовый Тогда 
		ВКМ_СоздатьУведомлениеВТелеграм("Создан новый документ обслуживания клиента");
		Возврат;
	КонецЕсли;  
		
	Если СменилосьВремя Тогда
		ВКМ_СоздатьУведомлениеВТелеграм("У документа " + Строка(ЭтотОбъект) + " сменилось время");
	КонецЕсли; 
	
	Если СменилсяСпециалист Тогда
		ВКМ_СоздатьУведомлениеВТелеграм("У документа " + Строка(ЭтотОбъект) + " сменился специалист");
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ВКМ_ДокументНеСоответствуетТребованиям() 
	  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора КАК ВКМ_ДоговорВидДоговора,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаНачалаДействияДоговора КАК ДоговорДатаНачалаДействияДоговора,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаОкончанияДействияДоговора КАК ДоговорДатаОкончанияДействияДоговора
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ВидДоговора = ВыборкаДетальныеЗаписи.ВКМ_ДоговорВидДоговора;
		ДатаОкончанияДействияДоговора = ВыборкаДетальныеЗаписи.ДоговорДатаОкончанияДействияДоговора;
	КонецЕсли;
		
	Если ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда  
		Сообщение = Новый СообщениеПользователю();
        Сообщение.Текст = "У выбранного договора выбран неверный вид договора";
        Сообщение.Сообщить();
		Возврат Истина;
	КонецЕсли;  
	
	Если Дата > ДатаОкончанияДействияДоговора И ЗначениеЗаполнено(ДатаОкончанияДействияДоговора) Тогда
		Сообщение = Новый СообщениеПользователю();
        Сообщение.Текст = "Выбранный договор перестал действовать";
        Сообщение.Сообщить();
		Возврат Истина;
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции 

Функция ПолучитьПроцентСпециалиста()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|ГДЕ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	Запрос.УстановитьПараметр("Период", Дата);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда 
		Возврат РезультатЗапроса.ПроцентОтРабот;
	КонецЕсли; 
	
	Возврат Неопределено;
КонецФункции

Процедура ВКМ_СделатьДвиженияДокумента(ПроцентСпециалиста)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СтоимостьЧасаРаботы Как ВКМ_СтоимостьЧасаРаботы
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтоимостьЧасаРаботы = ВыборкаДетальныеЗаписи.ВКМ_СтоимостьЧасаРаботы;
	КонецЕсли;
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.Договор = Договор;
	Движение.КоличествоЧасов = ВыполненныеРаботы.Итог("ЧасыКОплате");
	Движение.СуммаКОплате = Движение.КоличествоЧасов * СтоимостьЧасаРаботы;
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Специалист;
	Движение.ЧасовКОплате = ВыполненныеРаботы.Итог("ЧасыКОплате");
	Движение.СуммаКОплате = Движение.ЧасовКОплате * СтоимостьЧасаРаботы * ПроцентСпециалиста / 100;  
	
КонецПроцедуры

Процедура ВКМ_СоздатьУведомлениеВТелеграм(ТекстУведомления)  
	
	НовоеУведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	НовоеУведомление.ТекстСообщения = ТекстУведомления;
	
	Попытка
		НовоеУведомление.Записать(); 
	Исключение
		Сообщение = Новый СообщениеПользователю();
        Сообщение.Текст = "Не удалось создать уведомление в телеграм";
        Сообщение.Сообщить();
	КонецПопытки;
КонецПроцедуры  
#КонецОбласти
#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли