#Область ОбработчикиСобытий
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ВКМ_ДокументНеСоответствуетТребованиям() Тогда
		Отказ = Истина;
	КонецЕсли;
	
 	ПроцентСпециалиста = ПолучитьПроцентСпециалиста();
	Если ПроцентСпециалиста = Неопределено Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не Отказ Тогда
		ВКМ_СделатьДвиженияДокумента(ПроцентСпециалиста); 
	КонецЕсли;		
	
КонецПроцедуры  

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция ВКМ_ДокументНеСоответствуетТребованиям() 
	  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВидДоговора КАК ВКМ_ДоговорВидДоговора,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВКМ_ДатаНачалаДействияДоговора КАК ВКМ_ДоговорВКМ_ДатаНачалаДействияДоговора,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВКМ_ДатаОкончанияДействияДоговора КАК ВКМ_ДоговорВКМ_ДатаОкончанияДействияДоговора
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ВидДоговора = ВыборкаДетальныеЗаписи.ВКМ_ДоговорВидДоговора;
		ВКМ_ДатаОкончанияДействияДоговора = ВыборкаДетальныеЗаписи.ВКМ_ДоговорВКМ_ДатаОкончанияДействияДоговора;
	КонецЕсли;
		
	Если ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда  
		Сообщение = Новый СообщениеПользователю();
        Сообщение.Текст = "У выбранного договора выбран неверный вид договора";
        Сообщение.Сообщить();
		Возврат Истина;
	КонецЕсли;  
	
	Если Дата > ВКМ_ДатаОкончанияДействияДоговора И ЗначениеЗаполнено(ВКМ_ДатаОкончанияДействияДоговора) Тогда
		Сообщение = Новый СообщениеПользователю();
        Сообщение.Текст = "Выбранный договор перестал действовать";
        Сообщение.Сообщить();
		Возврат Истина;
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции 

Функция ПолучитьПроцентСпециалиста()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_ПроцентОтРабот КАК ВКМ_ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|ГДЕ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник = &ВКМ_Сотрудник";
	
	Запрос.УстановитьПараметр("ВКМ_Сотрудник", ВКМ_Специалист);
	Запрос.УстановитьПараметр("Период", Дата);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда 
		Возврат РезультатЗапроса.ВКМ_ПроцентОтРабот;
	КонецЕсли; 
	
	Возврат Неопределено;
КонецФункции


Процедура ВКМ_СделатьДвиженияДокумента(ПроцентСпециалиста)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВКМ_СтоимостьЧасаРаботы Как ВКМ_СтоимостьЧасаРаботы
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтоимостьЧасаРаботы = ВыборкаДетальныеЗаписи.ВКМ_СтоимостьЧасаРаботы;
	КонецЕсли;
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.Период = Дата;
	Движение.ВКМ_Клиент = ВКМ_Клиент;
	Движение.ВКМ_Договор = ВКМ_Договор;
	Движение.ВКМ_КоличествоЧасов = ВКМ_ВыполненныеРаботы.Итог("ВКМ_ЧасыКОплате");
	Движение.ВКМ_СуммаКОплате = Движение.ВКМ_КоличествоЧасов * СтоимостьЧасаРаботы;
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
	Движение.Период = Дата;
	Движение.ВКМ_Сотрудник = ВКМ_Специалист;
	Движение.ВКМ_ЧасовКОплате = ВКМ_ВыполненныеРаботы.Итог("ВКМ_ЧасыКОплате");
	Движение.ВКМ_СуммаКОплате = Движение.ВКМ_ЧасовКОплате * СтоимостьЧасаРаботы * ПроцентСпециалиста / 100;  
	
КонецПроцедуры

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
#КонецОбласти
