
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Отказ Тогда   
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Дата,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Специалист
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДатаДокумента = ВыборкаДетальныеЗаписи.Дата;
		Специалист = ВыборкаДетальныеЗаписи.ВКМ_Специалист;
	КонецЕсли;
	
	ПараметрыЗаписи.Вставить("ЭтоНовый", Ложь);
	Если Не ОбщегоНазначения.СсылкаСуществует(ТекущийОбъект.Ссылка) Тогда
		ПараметрыЗаписи.ЭтоНовый = Истина;
		Возврат;
	КонецЕсли;    
	
	ПараметрыЗаписи.Вставить("СменилосьВремя", Ложь);
	Если ДатаДокумента <> ТекущийОбъект.Дата Тогда
		ПараметрыЗаписи.СменилосьВремя = Истина;
	КонецЕсли; 
	
	ПараметрыЗаписи.Вставить("СменилсяСпециалист", Ложь);
	Если Специалист <> ТекущийОбъект.ВКМ_Специалист Тогда
		ПараметрыЗаписи.СменилсяСпециалист = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.ЭтоНовый Тогда 
		ВКМ_СоздатьУведомлениеВТелеграм("Создан новый документ обслуживания клиента");
		Возврат;
	КонецЕсли;  
		
	Если ПараметрыЗаписи.СменилосьВремя Тогда
		ВКМ_СоздатьУведомлениеВТелеграм("У документа " + Строка(ТекущийОбъект) + " сменилось время");
	КонецЕсли; 
	
	Если ПараметрыЗаписи.СменилсяСпециалист Тогда
		ВКМ_СоздатьУведомлениеВТелеграм("У документа " + Строка(ТекущийОбъект) + " сменился специалист");
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
КонецПроцедуры

&НаСервере 
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры


#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаСервере
Процедура ВКМ_СоздатьУведомлениеВТелеграм(ТекстУведомления)  
	
	НовоеУведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	НовоеУведомление.ВКМ_ТекстСообщения = ТекстУведомления;
	
	Попытка
		НовоеУведомление.Записать(); 
	Исключение
		Сообщение = Новый СообщениеПользователю();
        Сообщение.Текст = "Не удалось создать уведомление в телеграм";
        Сообщение.Сообщить();
	КонецПопытки;
КонецПроцедуры  
#КонецОбласти
