#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ВКМ_СделатьДвижения();
КонецПроцедуры
#КонецОбласти  
  
#Область СлужебныеПроцедурыИФункции
Процедура ВКМ_СделатьДвижения() 
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина; 
	ТекущаяДата = ТекущаяДатаСеанса();

	Для Каждого ТекСтр Из ВКМ_Сотрудники Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
        Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ВКМ_Премия;
        Движение.ПериодДействияНачало = Дата;
        Движение.ПериодДействияКонец = Дата;
        Движение.ВКМ_Сотрудник = ТекСтр.ВКМ_Сотрудник;
        Движение.ВКМ_Сумма = ТекСтр.ВКМ_СуммаПремии;  
		Движение.Регистратор = Ссылка; 
		Движение.ПериодРегистрации = ТекущаяДата;        
	
        Движение = Движения.ВКМ_Удержания.Добавить();
        Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.ВКМ_НДФЛ;
        Движение.ПериодДействияНачало = НачалоМесяца(Дата);
        Движение.ПериодДействияКонец = КонецМесяца(Дата);
        Движение.ВКМ_Сотрудник = ТекСтр.ВКМ_Сотрудник;
        Движение.ВКМ_Сумма = ТекСтр.ВКМ_СуммаПремии * 0.13;
		Движение.Регистратор = Ссылка;
		Движение.ПериодРегистрации = ТекущаяДата;
		
        ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
        ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
        ДвижениеВзаиморасчеты.Период = Дата;
        ДвижениеВзаиморасчеты.ВКМ_Сотрудник = ТекСтр.ВКМ_Сотрудник;
        ДвижениеВзаиморасчеты.ВКМ_Сумма = ТекСтр.ВКМ_СуммаПремии - Движение.ВКМ_Сумма; 
		ДвижениеВзаиморасчеты.Регистратор = Ссылка;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
