#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ВКМ_СделатьДвижения();
КонецПроцедуры
#КонецОбласти  
  
#Область СлужебныеПроцедурыИФункции
Процедура ВКМ_СделатьДвижения() 
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина; 
	ТекущаяДата = ТекущаяДатаСеанса();

	Для Каждого ТекСтр Из Сотрудники Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
        Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПроцентЗаказов;
        Движение.ПериодДействияНачало = Дата;
        Движение.ПериодДействияКонец = Дата;
        Движение.Сотрудник = ТекСтр.Сотрудник;
        Движение.Сумма = ТекСтр.СуммаПремии;  
		Движение.Регистратор = Ссылка; 
		Движение.ПериодРегистрации = ТекущаяДата;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);        
	
        Движение = Движения.ВКМ_Удержания.Добавить();
        Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
        Движение.ПериодДействияНачало = НачалоМесяца(Дата);
        Движение.ПериодДействияКонец = КонецМесяца(Дата);
        Движение.Сотрудник = ТекСтр.Сотрудник;
        Движение.Сумма = ТекСтр.СуммаПремии * 0.13;
		Движение.Регистратор = Ссылка;
		Движение.ПериодРегистрации = ТекущаяДата;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата); 
		
        ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
        ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
        ДвижениеВзаиморасчеты.Период = Дата;
        ДвижениеВзаиморасчеты.Сотрудник = ТекСтр.Сотрудник;
        ДвижениеВзаиморасчеты.Сумма = ТекСтр.СуммаПремии - Движение.Сумма; 
		ДвижениеВзаиморасчеты.Регистратор = Ссылка;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
