
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВКМ_Заполнить(Команда)
	ВКМ_ЗаполнитьНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВКМ_ЗаполнитьНаСервере()  
	Объект.ВКМ_ОсновныеНачисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_Специалисты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВтСпециалисты
		|ИЗ
		|	Справочник.ВКМ_Специалисты КАК ВКМ_Специалисты
		|ГДЕ
		|	НЕ ВКМ_Специалисты.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.ВКМ_Сотрудник КАК Сотрудник,
		|	ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.ВКМ_ДатаНачала КАК ДатаНачала,
		|	ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.ВКМ_ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВтГрафики
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ВКМ_ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников
		|ГДЕ
		|	ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.Ссылка.Проведен
		|	И ГОД(ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.Ссылка.ВКМ_Год) = &Год
		|	И &Месяц = МЕСЯЦ(ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.ВКМ_ДатаНачала)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтСпециалисты.Ссылка КАК ВКМ_Сотрудник,
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Оклад, 0) КАК ВКМ_Оклад,
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_ПроцентОтРабот, 0) КАК ВКМ_ПроцентОтРабот,
		|	ВтГрафики.ДатаНачала КАК ДатаНачала,
		|	ВтГрафики.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	ВтСпециалисты КАК ВтСпециалисты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВтСпециалисты.Ссылка = ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтГрафики КАК ВтГрафики
		|		ПО ВтСпециалисты.Ссылка = ВтГрафики.Сотрудник";
	
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("Год", Год(Объект.Дата));
	Запрос.УстановитьПараметр("Месяц", Месяц(Объект.Дата));

	Выборка = Запрос.Выполнить().Выгрузить();
	Для Каждого ТекСтр Из Выборка Цикл  
		Если ТекСтр.ВКМ_Оклад > 0 Тогда
			Строка = Объект.ВКМ_ОсновныеНачисления.Добавить();
			Строка.ВКМ_Сотрудник = ТекСтр.ВКМ_Сотрудник;  
			Строка.ВКМ_ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Оклад;
			Строка.ВКМ_Размер = ТекСтр.ВКМ_Оклад;                                      
			Строка.ВКМ_ДатаНачала = НачалоМесяца(Объект.Дата);
			Строка.ВКМ_ДатаОкончания = КонецМесяца(Объект.Дата);
		КОнецЕсли;
		
		Если ЗначениеЗаполнено(ТекСтр.ДатаНачала) Тогда
			Строка = Объект.ВКМ_ОсновныеНачисления.Добавить();
			Строка.ВКМ_Сотрудник = ТекСтр.ВКМ_Сотрудник;  
			Строка.ВКМ_ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Отпуск;
			Строка.ВКМ_Размер = 0;                                      
			Строка.ВКМ_ДатаНачала = ТекСтр.ДатаНачала;
			Строка.ВКМ_ДатаОкончания = ТекСтр.ДатаОкончания;
		КОнецЕсли; 
		
		КонецЦикла;
	
КонецПроцедуры
#КонецОбласти