
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВКМ_Заполнить(Команда)
	ВКМ_ЗаполнитьНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВКМ_ЗаполнитьНаСервере()  
	Объект.ОсновныеНачисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_Специалисты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВтСпециалисты
		|ИЗ
		|	Справочник.ВКМ_Специалисты КАК ВКМ_Специалисты
		|ГДЕ
		|	НЕ ВКМ_Специалисты.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВтГрафики
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка.Проведен
		|	И ГОД(ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка.Год) = &Год
		|	И &Месяц = МЕСЯЦ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтСпециалисты.Ссылка КАК Сотрудник,
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад,
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот, 0) КАК ПроцентОтРабот,
		|	ВтГрафики.ДатаНачала КАК ДатаНачала,
		|	ВтГрафики.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	ВтСпециалисты КАК ВтСпециалисты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВтСпециалисты.Ссылка = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтГрафики КАК ВтГрафики
		|		ПО ВтСпециалисты.Ссылка = ВтГрафики.Сотрудник";
	
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("Год", Год(Объект.Дата));
	Запрос.УстановитьПараметр("Месяц", Месяц(Объект.Дата));

	Выборка = Запрос.Выполнить().Выгрузить();
	Для Каждого ТекСтр Из Выборка Цикл  
		Если ТекСтр.Оклад > 0 Тогда
			Строка = Объект.ОсновныеНачисления.Добавить();
			Строка.Сотрудник = ТекСтр.Сотрудник;  
			Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад;
			Строка.Размер = ТекСтр.Оклад;                                      
			Строка.ДатаНачала = НачалоМесяца(Объект.Дата);
			Строка.ДатаОкончания = КонецМесяца(Объект.Дата);
			Строка.ГрафикРабот = Справочники.ВКМ_ТипыГрафиков.НайтиПоКоду("000000001");
			
			Строка = Объект.ОсновныеНачисления.Добавить();
			Строка.Сотрудник = ТекСтр.Сотрудник;
			Строка.ДатаНачала = НачалоМесяца(Объект.Дата);
			Строка.ДатаОкончания = КонецМесяца(Объект.Дата);
			Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПроцентЗаказов;
			
			Строка = Объект.ОсновныеНачисления.Добавить();
			Строка.Сотрудник = ТекСтр.Сотрудник;  
			Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
			Строка.Размер = 0;                                      
			Строка.ДатаНачала = НачалоМесяца(Объект.Дата);
			Строка.ДатаОкончания = КонецМесяца(Объект.Дата);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекСтр.ДатаНачала) Тогда
			Строка = Объект.ОсновныеНачисления.Добавить();
			Строка.Сотрудник = ТекСтр.Сотрудник;  
			Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск;
			Строка.Размер = 0;                                      
			Строка.ДатаНачала = ТекСтр.ДатаНачала;
			Строка.ДатаОкончания = ТекСтр.ДатаОкончания;
			Строка.ГрафикРабот = Справочники.ВКМ_ТипыГрафиков.НайтиПоКоду("000000001");
		КОнецЕсли; 
				
		КонецЦикла;
	
КонецПроцедуры
#КонецОбласти