#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	ВКМ_СделатьДвижения();
КонецПроцедуры
#КонецОбласти  

#Область СлужебныеПроцедурыИФункции
 

Процедура ВКМ_СделатьДвижения()   
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина; 
	Движения.ВКМ_Удержания.Записывать = Истина;  
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	ТаблицаРаботСотрудников = ПолучитьТаблицуСРаботамиСотрудниковЗаМесяц();	
	Пятидневка = Справочники.ВКМ_ТипыГрафиков.НайтиПоКоду("000000001");
	
	Для Каждого ТекСтр Из ВКМ_ОсновныеНачисления Цикл 
		Если ТипЗнч(ТекСтр.ВКМ_ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ОсновныеНачисления") Тогда
			НоваяСтрока = Движения.ВКМ_ОсновныеНачисления.Добавить();  
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтр); 
			НоваяСтрока.ВКМ_ГрафикРабот = Пятидневка; 
			НоваяСтрока.ВКМ_Сумма = ТекСтр.ВКМ_Размер; 
			НоваяСтрока.ВидРасчета = ТекСтр.ВКМ_ВидРасчета;
			НоваяСтрока.ПериодРегистрации = ВКМ_ПериодРегистрации;
			НоваяСтрока.ПериодДействияНачало = ТекСтр.ВКМ_ДатаНачала;
			НоваяСтрока.ПериодДействияКонец = КонецДня(ТекСтр.ВКМ_ДатаОкончания);
			Продолжить;
		КонецЕсли;
		
		СуммаПоПроцентам = 0;
		НайденныеСтрокиРабот = ТаблицаРаботСотрудников.НайтиСтроки(Новый Структура("Сотрудник", ТекСтр.ВКМ_Сотрудник)); 
		Если НайденныеСтрокиРабот.Количество() > 0 Тогда 
			СуммаПоПроцентам = НайденныеСтрокиРабот[0].СуммаКОплате;
			Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
            Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ВКМ_ПроцентЗаказов;
            Движение.ПериодДействияНачало = НачалоМесяца(Дата);
            Движение.ПериодДействияКонец = КонецМесяца(Дата);
            Движение.ВКМ_Сотрудник = ТекСтр.ВКМ_Сотрудник;
            Движение.ВКМ_Сумма = СуммаПоПроцентам; 
			Движение.Регистратор = Ссылка;
			Движение.ПериодРегистрации = ВКМ_ПериодРегистрации;
		КонецЕсли;
		
		Если СуммаПоПроцентам <> 0 Тогда
			Движение = Движения.ВКМ_Удержания.Добавить();
	        Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.ВКМ_НДФЛ;
	        Движение.ПериодДействияНачало = НачалоМесяца(Дата);
	        Движение.ПериодДействияКонец = КонецМесяца(Дата);
	        Движение.ВКМ_Сотрудник = ТекСтр.ВКМ_Сотрудник;
	        Движение.ВКМ_Сумма = СуммаПоПроцентам * 0.13;
			Движение.Регистратор = Ссылка; 
			Движение.ПериодРегистрации = ВКМ_ПериодРегистрации;  
			
			ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
			ДвижениеВзаиморасчеты.Период = ВКМ_ПериодРегистрации;
			ДвижениеВзаиморасчеты.ВКМ_Сотрудник = ТекСтр.ВКМ_Сотрудник;
			ДвижениеВзаиморасчеты.ВКМ_Сумма = СуммаПоПроцентам - Движение.ВКМ_Сумма; 
			ДвижениеВзаиморасчеты.Регистратор = Ссылка;
		КонецЕсли;
	КонецЦикла; 
	
	Движения.Записать();
	ВКМ_ПроведениеРасчетов.ВКМ_Рассчитать(Движения.ВКМ_ОсновныеНачисления, Ссылка); 
	
	Движения.ВКМ_Удержания.Записывать = Истина;  
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

	Для Каждого ТекСтр Из Движения.ВКМ_ОсновныеНачисления Цикл 
		Движение = Движения.ВКМ_Удержания.Добавить();
        Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.ВКМ_НДФЛ;
        Движение.ПериодДействияНачало = ТекСтр.ПериодДействияНачало;
        Движение.ПериодДействияКонец = ТекСтр.ПериодДействияКонец;
        Движение.ВКМ_Сотрудник = ТекСтр.ВКМ_Сотрудник;
        Движение.ВКМ_Сумма = ТекСтр.ВКМ_Сумма  * 0.13;
		Движение.Регистратор = Ссылка; 
		Движение.ПериодРегистрации = ТекСтр.ПериодРегистрации;  
		
		ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеВзаиморасчеты.Период = ВКМ_ПериодРегистрации;
		ДвижениеВзаиморасчеты.ВКМ_Сотрудник = ТекСтр.ВКМ_Сотрудник;
		ДвижениеВзаиморасчеты.ВКМ_Сумма = ТекСтр.ВКМ_Сумма - Движение.ВКМ_Сумма; 
		ДвижениеВзаиморасчеты.Регистратор = Ссылка;
	КонецЦикла;
	
	Движения.Записать();
КонецПроцедуры


Функция ПолучитьТаблицуСРаботамиСотрудниковЗаМесяц() 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.ВКМ_Сотрудник КАК Сотрудник,
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.ВКМ_СуммаКОплатеОборот КАК СуммаКОплате
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции   

#КонецОбласти
#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
