#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		Если Отказ Тогда
			Возврат;
		КонецЕсли; 
		
		СформироватьДвижения();
		
		РасчитатьОклад();
		РасчитатьОтпуск();
		РасчитатьНДФЛ();
		
КонецПроцедуры
#КонецОбласти   

#Область СлужебныеПроцедурыИФункции	
Процедура СформироватьДвижения()
		
		СформироватьДвиженияПоОкладу();
		СформироватьДвиженияПрочиеОсновныеНачисления();
		СформироватьДвиженияДополнительныеНачисления(); 
		СформироватьДвиженияНДФЛ();
		
		Движения.ВКМ_ОсновныеНачисления.Записать();
		Движения.ВКМ_ДополнительныеНачисления.Записать();
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
		Движения.ВКМ_Удержания.Записать();
КонецПроцедуры   

Процедура РасчитатьНДФЛ() 
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_Удержания.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.СуммаБаза, 0) КАК БазаДоп,
		|	ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.СуммаБаза, 0) КАК БазаОсн,
		|	ВКМ_Удержания.Сотрудник КАК Сотрудник,
		|	ВКМ_Удержания.ПериодРегистрации КАК ПериодРегистрации
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(
		|				&Измерения,
		|				&Измерения,
		|				,
		|				Регистратор = &Ссылка
		|					И ВидРасчета = &НДФЛ) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления
		|		ПО ВКМ_Удержания.НомерСтроки = ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(
		|				&Измерения,
		|				&Измерения,
		|				,
		|				Регистратор = &Ссылка
		|					И ВидРасчета = &НДФЛ) КАК ВКМ_УдержанияБазаВКМ_ОсновныеНачисления
		|		ПО ВКМ_Удержания.НомерСтроки = ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.НомерСтроки
		|ГДЕ
		|	ВКМ_Удержания.Регистратор = &Ссылка
		|	И ВКМ_Удержания.ВидРасчета = &НДФЛ";

		Запрос.УстановитьПараметр("НДФЛ", ПланыВидовРасчета.ВКМ_Удержания.НДФЛ);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);  
	
		Измерения = Новый Массив;
		Измерения.Добавить("Сотрудник");
				
		Запрос.УстановитьПараметр("Измерения", Измерения);
		
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Движение = Движения.ВКМ_Удержания[ВыборкаДетальныеЗаписи.НомерСтроки - 1];   
			
			СуммаНДФЛ =(ВыборкаДетальныеЗаписи.БазаОсн+ВыборкаДетальныеЗаписи.БазаДоп)* 0.13; 
			Движение.Сумма = СуммаНДФЛ;      
			
			
			ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
			ДвижениеВзаиморасчеты.Период = ВыборкаДетальныеЗаписи.ПериодРегистрации;
			ДвижениеВзаиморасчеты.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			ДвижениеВзаиморасчеты.Сумма = (ВыборкаДетальныеЗаписи.БазаОсн+ВыборкаДетальныеЗаписи.БазаДоп) - СуммаНДФЛ;
			ДвижениеВзаиморасчеты.Регистратор = Ссылка;  
		КонецЦикла;
		
		Движения.ВКМ_Удержания.Записать(,,Истина);
        ДВижения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры

Процедура СформироватьДвиженияПоОкладу()
		
		Для Каждого Строка из ОсновныеНачисления Цикл
			
			Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
				Продолжить;
			КонецЕсли;

			Если ТипЗнч(Строка.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ОсновныеНачисления") Тогда
				
				Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
				Движение.ПериодРегистрации = Дата;
				Движение.ВидРасчета = Строка.ВидРасчета;
				Движение.ПериодДействияНачало = Строка.ДатаНачала;
				Движение.ПериодДействияКонец = Строка.ДатаОкончания;
				Движение.Сотрудник = Строка.Сотрудник;
				Движение.Сумма = Строка.Размер;
				Движение.ГрафикРабот = Строка.ГрафикРабот;
				Движение.БазовыйПериодНачало = Строка.ДатаНачала;
				Движение.БазовыйПериодКонец = Строка.ДатаОкончания;
			КонецЕсли;	
		КонецЦикла; 		
КонецПроцедуры
	
Процедура СформироватьДвиженияПрочиеОсновныеНачисления()
		
		Для Каждого Строка из ОсновныеНачисления Цикл	
			Если ТипЗнч(Строка.ВидРасчета) <> Тип("ПланВидовРасчетаСсылка.ВКМ_ОсновныеНачисления") Тогда
				Продолжить;
			КонецЕсли; 
			
			Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
				Продолжить;
			КонецЕсли;
			
			Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
			Движение.ПериодРегистрации = Дата;
			Движение.ВидРасчета = Строка.ВидРасчета;
			Движение.ПериодДействияНачало = Строка.ДатаНачала;
			Движение.ПериодДействияКонец = Строка.ДатаОкончания;
			Движение.Сотрудник = Строка.Сотрудник;
			Движение.ГрафикРабот = Строка.ГрафикРабот;
			Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда 
				Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Строка.ДатаНачала, -12));
				Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(Строка.ДатаОкончания, -1)); 
			КонецЕсли;
		КонецЦикла;	
		
	КонецПроцедуры
	
Процедура СформироватьДвиженияНДФЛ()
		Движения.ВКМ_Удержания.Очистить();
		Для Каждого Строка из ОсновныеНачисления Цикл	
			Если ТипЗнч(Строка.ВидРасчета) <> Тип("ПланВидовРасчетаСсылка.ВКМ_Удержания") Тогда
				Продолжить;
			КонецЕсли; 
						
			Движение = Движения.ВКМ_Удержания.Добавить();
			Движение.ПериодРегистрации = Дата;
			Движение.ВидРасчета =  Строка.ВидРасчета; 
			Движение.Сотрудник = Строка.Сотрудник; 
			Движение.БазовыйПериодНачало = НачалоМесяца(Строка.ДатаНачала);
			Движение.БазовыйПериодКонец = КонецМесяца(Строка.ДатаОкончания); 
		КонецЦикла;	
		
КонецПроцедуры

	
Процедура СформироватьДвиженияДополнительныеНачисления()
			
	Для Каждого Строка из ОсновныеНачисления Цикл
		
		Если ТипЗнч(Строка.ВидРасчета) <> Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления") Тогда
			Продолжить;
		КонецЕсли; 
		ТаблицаРаботСотрудников = ПолучитьТаблицуСРаботамиСотрудниковЗаМесяц();
		СуммаПоПроцентам = 0;		
		НайденныеСтрокиРабот = ТаблицаРаботСотрудников.НайтиСтроки(Новый Структура("Сотрудник", Строка.Сотрудник)); 
		Если НайденныеСтрокиРабот.Количество() > 0 Тогда 
			СуммаПоПроцентам = НайденныеСтрокиРабот[0].СуммаКОплате;		
			
			Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
			Движение.ПериодРегистрации = Дата;
			Движение.ВидРасчета = Строка.ВидРасчета;
			Движение.Сотрудник = Строка.Сотрудник;
			Движение.Сумма = СуммаПоПроцентам; 
			
			Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПроцентЗаказов Тогда 
				Движение.БазовыйПериодНачало = Строка.ДатаНачала;
				Движение.БазовыйПериодКонец = Строка.ДатаОкончания; 
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;			
КонецПроцедуры
	
Процедура РасчитатьОклад()
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК ЗначениеПериодДействия,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
		|			Регистратор = &Ссылка
		|				И ВидРасчета = &Оклад) КАК ВКМ_ОсновныеНачисленияДанныеГрафика";
		
		Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
			Для Каждого ТекДвижение Из Движения.ВКМ_ОсновныеНачисления Цикл    
				Если ТекДвижение.НомерСтроки <> ВыборкаДетальныеЗаписи.НомерСтроки Тогда  
					Продолжить;
				КонецЕсли; 
				
				ТекДвижение.Сумма = ТекДвижение.Сумма / ВыборкаДетальныеЗаписи.ЗначениеПериодДействия * ВыборкаДетальныеЗаписи.Факт;
				ТекДвижение.ОтработаноЧасов = ВыборкаДетальныеЗаписи.Факт; 
				
			КонецЦикла;
		КонецЦикла;             
		
		Движения.ВКМ_ОсновныеНачисления.Записать(,,Истина);	 
КонецПроцедуры
	
Процедура РасчитатьОтпуск()
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.СуммаБаза, 0) КАК БазаОсн,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ОтработаноЧасовБаза, 0) КАК БазаОтработано,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.СуммаБаза, 0) КАК БазаДоп,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ДополнительныеНачисления(
		|				&Измерения,
		|				&Измерения,
		|				,
		|				Регистратор = &Ссылка
		|					И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления
		|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(
		|				&Измерения,
		|				&Измерения,
		|				,
		|				Регистратор = &Ссылка
		|					И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
		|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
		|				Регистратор = &Ссылка
		|					И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
		|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
		|	И ВКМ_ОсновныеНачисления.ВидРасчета = &Отпуск";
		
		Запрос.УстановитьПараметр("Отпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);  
	
		Измерения = Новый Массив;
		Измерения.Добавить("Сотрудник");
				
		Запрос.УстановитьПараметр("Измерения", Измерения);
		
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];   
			Движение.ОтработаноЧасов = ВыборкаДетальныеЗаписи.Факт;
			
			Если ВыборкаДетальныеЗаписи.БазаОтработано = 0 Тогда
				Движение.Сумма = 0;
				Продолжить;
			КонецЕсли;
			Движение.Сумма = (ВыборкаДетальныеЗаписи.БазаОсн + ВыборкаДетальныеЗаписи.БазаДоп)*  ВыборкаДетальныеЗаписи.Факт / ВыборкаДетальныеЗаписи.БазаОтработано;
		
		КонецЦикла;
		
		Движения.ВКМ_ОсновныеНачисления.Записать(,Истина);

КонецПроцедуры	
	
Функция ПолучитьТаблицуСРаботамиСотрудниковЗаМесяц() 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник КАК Сотрудник,
			|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот КАК СуммаКОплате
			|ИЗ
			|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты";
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
		Возврат Запрос.Выполнить().Выгрузить();
КонецФункции   
	
#КонецОбласти
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
