#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВКМ_ВидДоговораПриИзмененииСервер();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВКМ_ВидДоговораПриИзменении(Элемент)
	 ВКМ_ВидДоговораПриИзмененииСервер();
КонецПроцедуры 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВКМ_ВидДоговораПриИзмененииСервер() 
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.ГруппаАбонентскойПлаты.Видимость = Истина;
		Возврат;
	КонецЕсли;  
	
	Элементы.ГруппаАбонентскойПлаты.Видимость = Ложь;
КонецПроцедуры
#КонецОбласти

