
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ  Параметры.Свойство("ПутьКДанным") Тогда 
		Возврат;
	КонецЕсли;   
	
	СформироватьДиаграмму(ПолучитьИзВременногоХранилища(Параметры.ПутьКДанным));
КонецПроцедуры
#КонецОбласти  

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СформироватьДиаграмму(ТаблицаДанных) 
	Если ТаблицаДанных.Количество() <= 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();   
	
	СерияОтпуск = ДиаграммаГанта.УстановитьСерию("Отпуск");
	СерияОтпуск.Текст = "Отпуск";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДанных.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
		|	ТаблицаДанных.ВКМ_ДатаНачала КАК ВКМ_ДатаНачала,
		|	ТаблицаДанных.ВКМ_ДатаОкончания КАК ВКМ_ДатаОкончания
		|ПОМЕСТИТЬ ВтТаблица
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтТаблица.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
		|	ВтТаблица.ВКМ_ДатаНачала КАК ВКМ_ДатаНачала,
		|	ВтТаблица.ВКМ_ДатаОкончания КАК ВКМ_ДатаОкончания
		|ИЗ
		|	ВтТаблица КАК ВтТаблица
		|ИТОГИ ПО
		|	ВКМ_Сотрудник";
	
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	РезультатЗапроса = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);  
	
	Пока РезультатЗапроса.Следующий() Цикл    
		Точка = ДиаграммаГанта.УстановитьТочку(РезультатЗапроса.ВКМ_Сотрудник); 
		Точка.Текст = РезультатЗапроса.ВКМ_Сотрудник.Наименование;
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, СерияОтпуск);

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			Интервал = Значение.Добавить();
			Интервал.Начало = ВыборкаДетальныеЗаписи.ВКМ_ДатаНачала;
			Интервал.Конец = ВыборкаДетальныеЗаписи.ВКМ_ДатаОкончания;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
