#Область СлужебныеПроцедурыИФункции
Функция СоздатьАкты(ПериодМесяц, Организация) Экспорт 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
		|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиента.Договор.Организация КАК ДоговорОрганизация
		|ПОМЕСТИТЬ ВтДоговоры
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Проведен
		|	И ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора = &ВидДоговора
		|	И (ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаОкончанияДействияДоговора > &Период
		|			ИЛИ ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаОкончанияДействияДоговора = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|	И ВКМ_ОбслуживаниеКлиента.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиента.Договор,
		|	ВКМ_ОбслуживаниеКлиента.Клиент,
		|	ВКМ_ОбслуживаниеКлиента.Договор.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ДокументыСозданныеМассовымСозданиемАктов.Реализация КАК Реализация,
		|	ВтДоговоры.Договор КАК Договор,
		|	ВтДоговоры.Клиент КАК Контрагент,
		|	ВтДоговоры.ДоговорОрганизация КАК Организация
		|ИЗ
		|	ВтДоговоры КАК ВтДоговоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_ДокументыСозданныеМассовымСозданиемАктов КАК ВКМ_ДокументыСозданныеМассовымСозданиемАктов
		|		ПО (ВКМ_ДокументыСозданныеМассовымСозданиемАктов.ПериодДокумента = &Период)
		|			И ВтДоговоры.Договор = ВКМ_ДокументыСозданныеМассовымСозданиемАктов.Договор";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", ПериодМесяц); 
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ПериодМесяц));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодМесяц));
	
	МассивСтруктурРезультат = Новый Массив;
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	
		Для Каждого ТекДоговор Из РезультатЗапроса Цикл 
			Если ЗначениеЗаполнено(ТекДоговор.Реализация) Тогда  
			Продолжить;
		КонецЕсли; 
		
		НовыйЗаказПокупателя = Документы.ЗаказПокупателя.СоздатьДокумент(); 
		НовыйЗаказПокупателя.Заполнить(Неопределено);
		НовыйЗаказПокупателя.Дата = ПериодМесяц;
		ЗаполнитьЗначенияСвойств(НовыйЗаказПокупателя, ТекДоговор);
		
		НачатьТранзакцию();
		
		Попытка  
		НовыйЗаказПокупателя.Записать(РежимЗаписиДокумента.Проведение);
		
		НовыйДокументРеализации = Документы.РеализацияТоваровУслуг.СоздатьДокумент(); 
		НовыйДокументРеализации.Заполнить(НовыйЗаказПокупателя.Ссылка);
		НовыйДокументРеализации.Дата = ПериодМесяц;
		НовыйДокументРеализации.Основание = НовыйЗаказПокупателя.Ссылка;
		НовыйДокументРеализации.ВКМ_ВыполнитьАвтозаполнение(); 
		
		 Если Не НовыйДокументРеализации.ПроверитьЗаполнение() Тогда
           	ВызватьИсключение("Не корректно заполнена релализация");
         КонецЕсли;
            
         Если НовыйДокументРеализации.Товары.Количество() <= 0 Тогда
            ВызватьИсключение("У реализации нет товаров");
         КонецЕсли;
		
		НовыйДокументРеализации.Записать(РежимЗаписиДокумента.Проведение);
	
		НоваяЗаписьРегистра = РегистрыСведений.ВКМ_ДокументыСозданныеМассовымСозданиемАктов.СоздатьМенеджерЗаписи(); 
		НоваяЗаписьРегистра.Период = НачалоДня(ТекущаяДатаСеанса());
		НоваяЗаписьРегистра.ПериодДокумента = ПериодМесяц;
		НоваяЗаписьРегистра.Реализация = НовыйДокументРеализации.Ссылка;
		НоваяЗаписьРегистра.Договор = НовыйДокументРеализации.Договор;
		НоваяЗаписьРегистра.Записать();
		ЗафиксироватьТранзакцию();
		МассивСтруктурРезультат.Добавить(Новый Структура("Договор, Реализация", НовыйДокументРеализации.Договор, НовыйДокументРеализации.Ссылка));
		Исключение
			ОтменитьТранзакцию();
            ЗаписьЖурналаРегистрации("Ошибка при создании акта", УровеньЖурналаРегистрации.Ошибка,,,"Ошибка - " + Строка(ОписаниеОшибки()));
        КонецПопытки;
			
	КонецЦикла;

	Возврат МассивСтруктурРезультат; 
КонецФункции
#КонецОбласти