#Область СлужебныеПроцедурыИФункции
Функция СоздатьАкты(ПериодМесяц, Организация) Экспорт 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Договор КАК ВКМ_Договор,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Клиент КАК ВКМ_Клиент,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.Организация КАК ВКМ_ДоговорОрганизация
		|ПОМЕСТИТЬ ВтДоговоры
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Проведен
		|	И ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВидДоговора = &ВидДоговора
		|	И (ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВКМ_ДатаОкончанияДействияДоговора > &Период
		|			ИЛИ ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВКМ_ДатаОкончанияДействияДоговора = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|	И ВКМ_ОбслуживаниеКлиента.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Договор,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Клиент,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ДокументыСозданныеМассовымСозданиемАктов.ВКМ_Реализация КАК Реализация,
		|	ВтДоговоры.ВКМ_Договор КАК Договор,
		|	ВтДоговоры.ВКМ_Клиент КАК Контрагент,
		|	ВтДоговоры.ВКМ_ДоговорОрганизация КАК Организация
		|ИЗ
		|	ВтДоговоры КАК ВтДоговоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_ДокументыСозданныеМассовымСозданиемАктов КАК ВКМ_ДокументыСозданныеМассовымСозданиемАктов
		|		ПО (ВКМ_ДокументыСозданныеМассовымСозданиемАктов.ВКМ_ПериодДокумента = &Период)
		|			И ВтДоговоры.ВКМ_Договор = ВКМ_ДокументыСозданныеМассовымСозданиемАктов.ВКМ_Договор";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", ПериодМесяц); 
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ПериодМесяц));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодМесяц));
	
	МассивСтруктурРезультат = Новый Массив;
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	
		Для Каждого ТекДоговор Из РезультатЗапроса Цикл 
			Если ЗначениеЗаполнено(ТекДоговор.Реализация) Тогда  
			Продолжить;
		КонецЕсли; 
		
		НовыйЗаказПокупателя = Документы.ЗаказПокупателя.СоздатьДокумент(); 
		НовыйЗаказПокупателя.Заполнить(Неопределено);
		НовыйЗаказПокупателя.Дата = ПериодМесяц;
		ЗаполнитьЗначенияСвойств(НовыйЗаказПокупателя, ТекДоговор);
		
		НачатьТранзакцию();
		
		Попытка  
			НовыйЗаказПокупателя.Записать(РежимЗаписиДокумента.Проведение);
		Исключение  
			ЗаписьЖурналаРегистрации("Ошибка при создании заказа покупателя", УровеньЖурналаРегистрации.Ошибка,,,"Ошибка - " + Строка(ОписаниеОшибки()));
			ОтменитьТранзакцию();
			Продолжить;
		КонецПопытки; 
		
		НовыйДокументРеализации = Документы.РеализацияТоваровУслуг.СоздатьДокумент(); 
		НовыйДокументРеализации.Заполнить(НовыйЗаказПокупателя.Ссылка);
		НовыйДокументРеализации.Дата = ПериодМесяц;
		НовыйДокументРеализации.Основание = НовыйЗаказПокупателя.Ссылка;
		НовыйДокументРеализации.ВКМ_ВыполнитьАвтозаполнение(); 
		
		Если Не НовыйДокументРеализации.ПроверитьЗаполнение() Тогда  
			ОтменитьТранзакцию();
			Продолжить;
		КонецЕсли;  
		
		Если НовыйДокументРеализации.Товары.Количество() <= 0 Тогда  
			ОтменитьТранзакцию();
			Продолжить;
		КонецЕсли;
		
		Попытка   
			НовыйДокументРеализации.Записать(РежимЗаписиДокумента.Проведение);
		Исключение  
			ЗаписьЖурналаРегистрации("Ошибка при создании реализации", УровеньЖурналаРегистрации.Ошибка,,,"Ошибка - " + Строка(ОписаниеОшибки()));
			ОтменитьТранзакцию();
			Продолжить;
		КонецПопытки; 
		
		НоваяЗаписьРегистра = РегистрыСведений.ВКМ_ДокументыСозданныеМассовымСозданиемАктов.СоздатьМенеджерЗаписи(); 
		НоваяЗаписьРегистра.Период = НачалоДня(ТекущаяДатаСеанса());
		НоваяЗаписьРегистра.ВКМ_ПериодДокумента = ПериодМесяц;
		НоваяЗаписьРегистра.ВКМ_Реализация = НовыйДокументРеализации.Ссылка;
		НоваяЗаписьРегистра.ВКМ_Договор = НовыйДокументРеализации.Договор;
		НоваяЗаписьРегистра.Записать();
		
		ЗафиксироватьТранзакцию();
		МассивСтруктурРезультат.Добавить(Новый Структура("Договор, Реализация", НовыйДокументРеализации.Договор, НовыйДокументРеализации.Ссылка));
	КонецЦикла;

	Возврат МассивСтруктурРезультат; 
КонецФункции
#КонецОбласти