#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВКМ_ПериодПриИзменении(Элемент)
	Объект.Период = КонецМесяца(Объект.Период);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСозданныеДокументы
&НаКлиенте 
Процедура ВКМ_СозданныеДокументыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_СозданныеДокументыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте               
Процедура ВКМ_СозданныеДокументыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Создать(Команда)
	ВКМ_ЗапуститьСозданиеДокументов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВКМ_ЗапуститьСозданиеДокументов()
	// Проверка заполнения реквизитов на клиенте
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не указана организация";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не указан период";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ВКМ_СоздатьДокументыНаСервере(); 
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Новый ОписаниеОповещения("ПриЗавершенииСозданияДокументов", ЭтотОбъект), ПараметрыОжидания);
КонецПроцедуры

&НаСервере
Функция ВКМ_СоздатьДокументыНаСервере()
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "ВКМ_ОбщийМодуль.СоздатьАкты", Объект.Период, Объект.Организация);
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииСозданияДокументов(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат = Неопределено Тогда // Пользователь отменил задание.
	  	Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		Сообщение = Новый СообщениеПользователю();
        Сообщение.Текст = Результат.ПодробноеПредставлениеОшибки;
        Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	РезультатЗначение = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);     
		
	Для Каждого ТекСтруктура Из РезультатЗначение Цикл  
		НоваяСтрока = Объект.СозданныеДокументы.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтруктура);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти